{
  "passages": [
    {
      "title": "goood",
      "content": "gooood",
      "folderId": 4,
      "userId": 2,
      "id": 3,
      "reactions": {}
    },
    {
      "title": "50.1 Sexual Dimorphism in Lamprologus Callipterus",
      "content": "Lamprologus callipterus is one of over 300 species of cichlid (a freshwater fish) found only in Lake Tanganyika in Africa. Most African cichlids, including L.callipterus , exhibit sexual size dimorphism-the males are larger than the females. What is unusual about L. callipterus is the magnitude of the size difference. The key to understanding the sexual dimorphism of L.callipterus lies in the reproductive behavior of the species, particularly spawning (release of eggs by females and release of sperm by males) and brooding (protection of eggs). Female L.callipterus spawn and brood their eggs in empty snail shells on the lake bottom. In all other shell-brooding cichlids, both sexes enter the shell to spawn and thus both must be small enough to fit into the shells available on the lake bottom. In L. callipterus , however, only the females enter the shell to spawn and brood their eggs. The males remain outside, releasing their sperm only at the entrance to the shell. Consequently, female L. callipterus are small enough to fit into the shells, but the males, unconstrained by the need to enter shells, are much larger.\n\nSpawning and brooding inside shells puts females in an evolutionary dilemma with respect to their body size. In cichlids, as in most fishes, the number of eggs spawned per batch (the fecundity) increases with female body size, and this favors females that grow large. In L. callipterus the correlation between female length and number of eggs spawned is as high as 0.95, which means that more than 90 percent of the variation in fecundity among females can be explained by differences in body length. Further, because fecundity is more a function of body volume than length, it increases disproportionally as body length increases. In one study, for example, an increase in female length from 3 centimeters to 4 centimeters was associated with an increase in fecundity from 59 to 134 eggs. In addition to this huge fecundity boost, larger females are able to exclude smaller females from access to the larger, preferred shells and so gain in the competition for spawning sites. All this suggests that female L. callipterus should be large, but this is where the dilemma comes in. No matter how beneficial large size might be, the scarcity of large shells ultimately limits the size that females attain in a given population. In laboratory experiments females actually adjust their growth rates so that their body size at maturity matches that of the available shells, and in the wild the correlation between shell size and female size explains more than 98 percent of the variation in female size among populations. The ultimate size of female L. callipterus is thus a compromise between growing as large as possible to maximize fecundity and remaining small enough to be able to find suitable shells for spawning and brooding their young.\n\nFinding shells large enough for brooding is so critical for female L. callipterus that, when they are ready to spawn, they generally pay more attention to choosing shells than to choosing mates. Males have adopted a unique strategy to exploit this female choosiness. Rather than trying to attract females from afar with flamboyant displays, male L. callipterus entice females to mate with them by assembling piles of empty snail shells. They set up small territories, less than a meter in diameter, and each territory is centered on a patch of shells. In most areas of the lake these patches of shells are separated by stretches of sandy or rocky bottom devoid of shells. The males create this patchy distribution by picking up and carrying shells from as far away as 20 meters. In addition to clearing the surrounding area of abandoned shells, territorial males frequently steal shells from the shell piles of other males, sometimes with females and offspring inside. When this happens the female and her offspring usually disappear, and the empty shell becomes available for a new female in the territory of the male relocating the shell. The effect of this remarkable shell transporting is to create artificial clumps of shells surrounded by unsuitable stretches of lake bottom. When females are ready to spawn, they have to visit the shell piles of territorial males to find suitable shells, thus creating spawning opportunities for males.\n",
      "folderId": 1,
      "userId": 2,
      "id": 4,
      "reactions": {
        "thumbsUp": 0
      }
    },
    {
      "title": "50.2 Weather Forecasting",
      "content": "Because the many variables that affect weather are constantly changing, meteorologists have used high-speed computers to devise atmospheric models that describe the present state of the atmosphere. These are not physical models that paint a picture of a developing storm; they are, rather, mathematical models consisting of dozens of mathematical equations that describe how atmospheric pressure, winds, and moisture will change with time. Actually, the models do not fully represent the real atmosphere but are approximations formulated to retain the most important aspects of the atmosphere' s behavior.\n\nComputer-generated forecast charts using these models to interpret recorded weather data are known as prognostic charts, or simply progs. At present, there are a variety of models, and hence progs, from which to choose. One model may work best in predicting the position of troughs (elongated areas of low barometric pressure) in the upper atmosphere. Another may forecast the position of surface lows quite well. And some models even forecast the state of the atmosphere 384 hours (16 days) into the future.\n\nA good forecaster knows the idiosyncrasies of each model and carefully scrutinizes all the progs. The forecaster then makes a prediction based on the guidance of the computer. This prediction is a personalized practical interpretation of the weather situation given the local geographic features that influence the weather within the specific forecast area. Since the forecaster has access to hundreds of weather maps each day, why is it that forecasts are sometimes wrong?\n\nUnfortunately, there are flaws inherent in the computer models that limit the accuracy of weather forecasts. Computer-forecast models idealize the real atmosphere, meaning that each model makes certain assumptions about the atmosphere that may be accurate for some weather situations and be way off for others, so a forecaster who bases a prediction on an inaccurate prog may find a forecast of rain and wind turning out to be a day of clear and colder weather.\n\nAnother forecasting problem arises because the majority of models are not global in their coverage, and errors are able to creep in along a regional model's boundaries. A model that predicts the weather for North America may not accurately treat weather systems that move in along its boundary from the Pacific Ocean. Obviously, a good global model of similar sophistication would require an incredible number of computations.\n\nEven though many thousands of weather observations are taken worldwide each day, there are still regions where observations are sparse, particularly over the oceans and at higher latitudes. Temperature data recorded by satellites have helped to alleviate this problem, as the newest satellites are able to provide a more accurate profile of temperature for the computer models. Since the computer's forecast is only as good as the data fed into it and since observing stations may be so far apart that they miss certain weather features, a denser network of observations is needed, especially in remote areas, to ensure better forecasts in the future.\n\nAnother forecasting problem is that computer models cannot adequately interpret many of the factors that influence surface weather, such as the interactions of water, ice, and local terrain on weather systems. Some models do take large geographic features such as mountain chains and oceans into account, while ignoring smaller features such as hills and lakes. These smaller features can have a marked influence on the local weather. Given the effect of local terrain, as well as the impact of some of the other problems previously mentioned, computer forecasts presently do an inadequate job of predicting local weather conditions, such as surface temperatures, winds, and precipitation.\n\nEven with a denser network of observing stations and near-perfect computer models, there are countless small, unpredictable atmospheric fluctuations that fall under the heading of chaos. These small disturbances, as well as small errors (uncertainties) in the data, generally amplify with time as the computer tries to project the weather further and further into the future. After a number of days, these initial imperfections (errors) tend to dominate, and the forecast shows little or no skill in predicting the behavior of the real atmosphere.\n",
      "folderId": 1,
      "userId": 2,
      "id": 5,
      "reactions": {}
    }
  ],
  "lastId": 5
}